benchmarks/results/log/5001_5000conn.txt
Running 10s test @ http://localhost:5001
  6 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   358.23ms   27.36ms 428.44ms   86.43%
    Req/Sec     1.11k   846.16     3.90k    70.34%
  53040 requests in 10.08s, 13.25MB read
  Socket errors: connect 1122, read 34, write 0, timeout 25
Requests/sec:   5263.36
Transfer/sec:      1.32MB
Thread 1: 53040 requests, 5263.36 rps, 358.23ms avg latency
Thread 2: 53040 requests, 5263.36 rps, 358.23ms avg latency
Thread 3: 53040 requests, 5263.36 rps, 358.23ms avg latency
Thread 4: 53040 requests, 5263.36 rps, 358.23ms avg latency
Thread 5: 53040 requests, 5263.36 rps, 358.23ms avg latency
Thread 6: 53040 requests, 5263.36 rps, 358.23ms avg latency